<!--
============================================================
 App.vue
============================================================
 Корневой компонент всего Vue-приложения.
 Монтируется на место тега с id #app
 Добавляет компонент для работы с маршрутами <router-view>
============================================================
-->
<template>
  <div id="app">
    <!-- Выводим компонент активного маршрута (страницы) -->
    <router-view/>
  </div>
</template>

<script>
export default {
  name: 'App'
}
</script>

<style>
/* Выставяляем высоту во весь экран */
#app {
  height: 100%;
}
</style>
